In [1]:
import pandas as pd

**Ejercicio 1:** Crear una serie con la siguiente lista, la cual contiene la altura de un grupo de personas medidas en cm

In [2]:
altura=[166,159,168,173,162,178]

In [9]:
serie_altura = pd.Series(altura)
serie_altura

0    166
1    159
2    168
3    173
4    162
5    178
dtype: int64

**Ejercicio 2:** Obtener la altura máxima en la serie anterior

In [10]:
serie_altura.max()

178

**Ejercicio 3:** Obtener las alturas superiores a 165 cm

In [13]:
serie_altura[serie_altura > 165]

0    166
2    168
3    173
5    178
dtype: int64

**Ejercicio 4:** calcular la altura en metros (dividir los valores en la columna altura entre 100)

In [15]:
serie_altura = serie_altura / 100
serie_altura

0    1.66
1    1.59
2    1.68
3    1.73
4    1.62
5    1.78
dtype: float64

**Ejercicio 5:** Crear un DataFrame utilizando la siguiente información, utilizar la columna flor como índice

In [18]:
datos = {
    "flor": ["Rosa", "Tulipan", "Hortensia", "Anturio", "Alstroemeria", "Girasol", "Gerbera"],
    "precio": [12, 15, 9, 18, 21, 13, 18],
    "stock": [2900, 2300, 1800, 1900, 1700, 2500, 2200]
}

In [21]:
flores = pd.DataFrame(datos, index=datos["flor"], columns=["precio", "stock"])
flores

              precio  stock
Rosa              12   2900
Tulipan           15   2300
Hortensia          9   1800
Anturio           18   1900
Alstroemeria      21   1700
Girasol           13   2500
Gerbera           18   2200

**Ejercicio 6:** Obtener la información de las rosas y hortencias, también obtener sólo el precio de estas

In [24]:
flores.loc[["Rosa", "Hortensia"]]

           precio  stock
Rosa           12   2900
Hortensia       9   1800

In [25]:
flores.loc[["Rosa", "Hortensia"], ["precio"]]

           precio
Rosa           12
Hortensia       9

**Ejercicio 7**: Obtener la información sobre las flores en la posición 2 y 3

In [31]:
flores.iloc[[1, 2], :] # usar : para mostrar todas las columnas

           precio  stock
Tulipan        15   2300
Hortensia       9   1800

**Ejercicio 8:** Obtener los datos de la columna precio

In [33]:
flores.precio

Rosa            12
Tulipan         15
Hortensia        9
Anturio         18
Alstroemeria    21
Girasol         13
Gerbera         18
Name: precio, dtype: int64

In [34]:
flores["precio"]

Rosa            12
Tulipan         15
Hortensia        9
Anturio         18
Alstroemeria    21
Girasol         13
Gerbera         18
Name: precio, dtype: int64

**Ejercicio 9:** Obtener el precio promedio de las flores

In [36]:
flores["precio"].mean()

15.142857142857142

**Ejercicio 10:** Obtener los registros de las flores con un stock superior a 2000

In [45]:
flores.loc[flores["stock"]>2000, ["precio"]]

         precio
Rosa         12
Tulipan      15
Girasol      13
Gerbera      18

**Ejercicio 11:** Calcular el precio de las flores por docena

In [57]:
def docena(x):
    return x * 12

flores["precio docena"] = flores["precio"].apply(docena)
flores

              precio  stock  precio docena
Rosa              12   2900            144
Tulipan           15   2300            180
Hortensia          9   1800            108
Anturio           18   1900            216
Alstroemeria      21   1700            252
Girasol           13   2500            156
Gerbera           18   2200            216

**Ejercicio 12:** Guardar el anteior DataFrame en un archivo llamado "flores.xlsx"

In [58]:
flores.to_excel("./flores.xlsx", sheet_name="flores", index_label="Flores")

In [59]:
pd.read_excel("./flores.xlsx", sheet_name="flores", index_col="Flores")

              precio  stock  precio docena
Flores
Rosa              12   2900            144
Tulipan           15   2300            180
Hortensia          9   1800            108
Anturio           18   1900            216
Alstroemeria      21   1700            252
Girasol           13   2500            156
Gerbera           18   2200            216